---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FloorParamIsStructural
source: html/c8008aca-4181-6235-3067-d93c0a3a0173.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FloorParamIsStructural Property

"Structural"

## Syntax (C#)
```csharp
public static ForgeTypeId FloorParamIsStructural { get; }
```